Revit 2027 API
FabricationPart.SetAirturnInfo Method
 Sets the air turn information for the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAirturnInfo(
	int index,
	int airturnId,
	bool locked
)
Public Sub SetAirturnInfo (
	index As Integer,
	airturnId As Integer,
	locked As Boolean
)
public:
void SetAirturnInfo(
	int index,
	int airturnId,
	bool locked
)
member SetAirturnInfo :
        index : int *
        airturnId : int *
        locked : bool -> unit
Parameters
index Int32
 The index of the air turn to set.
airturnId Int32
 The identifier of the air turn to set.
locked Boolean
 If true the air turn will be locked and not changed by automatic processes.
Exceptions
Exception | Condition
ArgumentException |  The air turn identifier is not valid.
ArgumentOutOfRangeException |  The air turn index is out of valid range.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace